[
    {
        "role":"Technical Writer II",
        "company":"Visier",
        "summary":"\n- Collaborate with a cross-functional team of Product Managers, Engineers, Architects, and UX Designers to write high-quality, developer-centered content.\n- Develop and maintain user-centric technical documentation, including tutorials, API documentation, and user guides. \n- Conduct SME interviews and transform technical insights into clear, concise, and user-friendly documentation. \n- Design visuals, diagrams, and code examples to improve comprehension of complex workflows. \n- Manage content governance, ensuring timely updates to reflect platform changes, new features, and evolving best practices.",
        "range":"October 2024 - Present "
    },
    {
        "role":"Senior Technical Writer",
        "company":"ActiveState Software",
        "summary":"\n- Served as product owner for all end-user and developer documentation, including REST API docs, how-to guides, and platform onboarding flows.\n- Coordinated with the Information Security team to create technical responses for RFPs and renewal inquiries, ensuring accuracy and compliance. \n- Led the restructuring of user-facing product documentation, transitioning from single-use resources to a task-based, modular content model. \n- Reviewed marketing content for technical accuracy and clarity, enforcing the company style guide to maintain consistent tone and terminology while strengthening product messaging.",
        "range":"May 2022 - October 2024"
    },
    {
        "role":"Technical Writer",
        "company":"Stormboard",
        "summary":"\n- Created and maintained customer-facing documentation including template guides, user stories, feature overviews, and knowledge base articles, ensuring clarity and alignment with UX and product design standards.\n- Partnered with Marketing, Product, Design, and Engineering teams to develop internal process documentation, streamlining cross-team knowledge sharing.\n- Produced training resources and onboarding materials to improve user adoption and internal product knowledge.\n- Applied content organization and information architecture principles to ensure documentation was easily searchable and accessible.",
        "range":"October 2020 - May 2022 "
    }
]
